               ##########################################################
               ###########################################################
               ################  Dev: Axƙƚყᶜᵈ#7227  ######################
               ###########################################################



#!/usr/bin/env python
# -*- coding: utf-8 -*-

################################################################################# CREDITOS
import socket
import os
import requests
import random
import getpass
import time
import sys
import time
import datetime


colors = ['red', 'yellow', 'green', 'cyan', 'blue', 'magenta','\x1b[38;5;206m']

#################################################################################  Definicion del Tiempo
date = datetime.datetime.now()
timed = date.strftime("%d\%m\%Y")
################################################################################# TMP

from colorama import *
################################################################################# CLA

clear = lambda: os.system('cls') if os.name == 'nt' else os.system('clear')
#################################################################################  Clear
def close():
    os._exit(0)
#################################################################################  Close
run = os.system
#################################################################################  Start

color = '\x1b[38;5;45m'
color2 = '\x1b[38;5;206m'
color3 = '\x1b[38;5;51m'
gray = '\x1b[38;5;206m'
reset = '\x1b[0m'
morado = '\x1b[38;5;56m'
rojo = '\x1b[38;5;196m'
cyan = '\x1b[38;5;51m'
azul = '\x1b[38;5;21m'
gris = '\033[90m'
U = '\x1b[38;5;196m'
L = '\x1b[38;5;56m'
C = '\x1b[38;5;51m'
#################################################################################  Definicion del Color


def cnc_demo_rip_router():
    clear()
    print(f'''
                  {gris}(\__.-. |
                  {gris}== ===_]+
                          {gris}|
 {gris}` - .
       {gris}` - {rojo}>->
      {gris}....           {gris}....           ....           ....
     {gris}||             ||             ||             ||
 {gris}/"""l|\        /"""l|\        /"""l|\        /"""l|\\
{gris}/_______\      /_______\      /_______\      /_______\\
{gris}|  .-.  |------|  .-.  |------|  .-.  |------|  .-.  |------
 __|L|__| .--. |__|L|__| .--. |__|L|__| .--. |__|L|__| .--.
{gris}_\  \\\p__`o-o'__\  \\\p__`o-o'__\  \\\p__`o-o'__\  \\\p__`o-o'_
{gris}------------------------------------------------------------
    ''')
    time.sleep(0.6)
    clear()
    print(f'''
                     {gris}(\__.-. |
                     {gris}== ===_]+
                             {gris}|
 {gris}` - .
       {gris}` - .
            {rojo}>->
      {gris}....           {gris}....           ....           ....
     {gris}||             ||             ||             ||
 {gris}/"""l|\        /"""l|\        /"""l|\        /"""l|\\
{gris}/_______\      /_______\      /_______\      /_______\\
{gris}|  .-.  |------|  .-.  |------|  .-.  |------|  .-.  |------
 {gris}__|L|__| .--. |__|L|__| .--. |__|L|__| .--. |__|L|__| .--.
{gris}_\  \\\p__`o-o'__\  \\\p__`o-o'__\  \\\p__`o-o'__\  \\\p__`o-o'_
{gris}------------------------------------------------------------
    ''')
    time.sleep(0.6)
    clear()
    print(f'''
                         {gris}(\__.-. |
                         {gris}== ===_]+
                                 {gris}|
 {gris}` - .
       {gris}` - .
            {gris}- 
              {gris}` {rojo}>->
      {gris}....          {gris} ....           ....           ....
     {gris}||             {gris}||             ||             ||
 {gris}/"""l|\        {gris}/"""l|\        /"""l|\        /"""l|\\
{gris}/_______\      {gris}/_______\      /_______\      /_______\\
{gris}|  .-.  |------{gris}|  .-.  |------|  .-.  |------|  .-.  |------
 {gris}__|L|__| .--. {gris}|__|L|__| .--. |__|L|__| .--. |__|L|__| .--.
{gris}_\  \\\p__`o-o'{gris}__\  \\\p__`o-o'__\  \\\p__`o-o'__\  \\\p__`o-o'_
{gris}------------------------------------------------------------
    ''')
    time.sleep(0.6)
    clear()
    print(f'''
                              {gris}(\__.-. |
                              {gris}== ===_]+
                                      {gris}|
 {gris}` - .
       {gris}` - .
            {gris}- 
              {gris}`
                {gris}- {rojo}>->
      {gris}....           {gris}....           ....           ....
     {gris}||             {gris}||             ||             ||
 {gris}/"""l|\        {gris}/"""l|\        /"""l|\        /"""l|\\
{gris}/_______\      {gris}/_______\      /_______\      /_______\\
{gris}|  .-.  |------{gris}|  .-.  |------|  .-.  |------|  .-.  |------
 {gris}__|L|__| .--. {gris}|__|L|__| .--. |__|L|__| .--. |__|L|__| .--.
{gris}_\  \\\p__`o-o'{gris}__\  \\\p__`o-o'__\  \\\p__`o-o'__\  \\\p__`o-o'_
{gris}---------------{gris}---------------------------------------------
    ''')
    time.sleep(0.6)
    clear()
    print(f'''
                              {gris}(\__.-. |
                              {gris}== ===_]+
                                      {gris}|
 {gris}` - .
       {gris}` - .
            {gris}- 
              {gris}`
               {gris} - 
      {gris}....       `   ....           ....           ....
     {gris}||          {rojo}>-> {gris}||             ||             ||
 {gris}/"""l|\        {gris}/"""l|\        /"""l|\        /"""l|\\
{gris}/_______\      {gris}/_______\      /_______\      /_______\\
{gris}|  .-.  |------|  .-.  |------|  .-.  |------|  .-.  |------
 {gris}__|L|__| .--. |__|L|__| .--. |__|L|__| .--. |__|L|__| .--.
{gris}_\  \\\p__`o-o'__\  \\\p__`o-o'__\  \\\p__`o-o'__\  \\\p__`o-o'_
{gris}------------------------------------------------------------
    ''')
    time.sleep(0.6)
    clear()
    print(f"""
     {gris}_.-^^---....,,--       
 {gris}_--                  --_  
{gris}<                        >)
{gris}|                         | 
 {gris}\._                   _./  
    {gris}```--. . , ; .--'''       
          {gris}| |   |             
       {gris}.-=||  | |=-.   
       {gris}`-={rojo}#$%&%$#=-'{gris}   
          {gris}| ;  :|     
 {gris}_____.,-#%&$@%#&#~,._____
    """)
    time.sleep(0.8)
    clear()

def cnc_demo_ports_Global():
    clear()
    print(f'''
\x1b[38;2;0;255;255m[ \x1b[38;2;233;233;233mCNC \x1b[38;2;0;255;255m] | \x1b[38;2;233;233;233mCloud Destroyer \x1b[38;2;0;255;255m | \x1b[38;2;0;255;255m[ \x1b[38;2;233;233;233m Layer4 \x1b[38;2;0;255;255m]

                       {Fore.CYAN}。                                    {Fore.CYAN}。                          {Fore.CYAN}。                                     {Fore.CYAN}。

                              {Fore.CYAN}。          {L}╔═╗{L}╦  ╔{L}═╗╦ ╦╔╦{L}╗　                        {Fore.CYAN}。
   {Fore.CYAN}。                                     {L}║  {L}║  ║{L} ║║ ║ ║{L}║　  {Fore.CYAN}。   
    　                                    {L}╚═╝{L}╩═╝╚{L}═╝╚═╝═╩{L}╝ {U}CL。
                              {U}════════╦═══════════════════════════╦════════                       {Fore.CYAN}。
      　                      {U}╦═══════╩═══════════════════════════╩═══════╗
                　            {U}║            　{Fore.CYAN}。                。         {U}║             　
               {Fore.CYAN}。             {U}║ =  =  =  ⚡ 𝓒𝓵𝓸𝓾𝓭 𝓓𝓮𝓼𝓽𝓻𝓸𝔂𝓮𝓻  ⚡  =   =  = ║    {Fore.CYAN}。
                              {U}║                  {Fore.CYAN}。　                     {U}║
 {Fore.CYAN}。         　                {U}╩═══════╦═══════════════════════════╦═══════╝                   {Fore.CYAN}。
                                      {U}╩═══════════════════════════╩═
                         {Fore.CYAN}。                                          {Fore.CYAN}。
                                  {U}═════════╦════════════════╦══════════
                           {U}╔═══════════════╩════════════════╩═══════════════╗
                           {U}║ \x1b[38;2;0;212;14m22 - \x1b[38;2;0;255;255mSSH                \x1b[38;2;0;212;14m80   - \x1b[38;2;0;255;255mHTTP            {U}║
                           {U}║ \x1b[38;2;0;212;14m23 - \x1b[38;2;0;255;255mTELNET             \x1b[38;2;0;212;14m443  - \x1b[38;2;0;255;255mHTTPS           {U}║   
                           {U}║ \x1b[38;2;0;212;14m30120 - \x1b[38;2;0;255;255mFiveM           \x1b[38;2;0;212;14m3074 - \x1b[38;2;0;255;255mXBOX            {U}║
                           {U}║ \x1b[38;2;0;212;14m53 - \x1b[38;2;0;255;255mDNS                \x1b[38;2;0;212;14m5060 - \x1b[38;2;0;255;255mPLAYSATION      {U}║
                           {U}╚════════════════════════════════════════════════╝
{Fore.CYAN}。
                                                                                                                {Fore.CYAN}。                                   
                                {Fore.CYAN}。                                             {Fore.CYAN}。

                                                                                                                         
''')


def cnc_demo_layer4_Methods():
    clear()
    print(f'''

    \x1b[38;2;0;255;255m[ \x1b[38;2;233;233;233mCNC DEMO\x1b[38;2;0;255;255m] | \x1b[38;2;233;233;233mCloud Destroyer \x1b[38;2;0;255;255m | \x1b[38;2;0;255;255m[ \x1b[38;2;233;233;233mLayer4\x1b[38;2;0;255;255m]

                       {Fore.CYAN}。                                    {Fore.CYAN}。                          {Fore.CYAN}。                                     {Fore.CYAN}。

                              {Fore.CYAN}。          {L}╔═╗{L}╦  ╔{L}═╗╦ ╦╔╦{L}╗　                        {Fore.CYAN}。
   {Fore.CYAN}。                                     {L}║  {L}║  ║{L} ║║ ║ ║{L}║　  {Fore.CYAN}。   
    　                                    {L}╚═╝{L}╩═╝╚{L}═╝╚═╝═╩{L}╝ {U}CL。
                              {U}════════╦═══════════════════════════╦════════                       {Fore.CYAN}。
      　                      {U}╦═══════╩═══════════════════════════╩═══════╗
                　            {U}║            　{Fore.CYAN}。                。         {U}║             　
               {Fore.CYAN}。             {U}║ =  =  =  ⚡ 𝓒𝓵𝓸𝓾𝓭 𝓓𝓮𝓼𝓽𝓻𝓸𝔂𝓮𝓻  ⚡  =   =  = ║    {Fore.CYAN}。
                              {U}║                  {Fore.CYAN}。　                     {U}║
 {Fore.CYAN}。         　                {U}╩═══════╦═══════════════════════════╦═══════╝                   {Fore.CYAN}。
                                      {U}╩═══════════════════════════╩═
                                              \x1b[38;2;0;255;255mfvck
                         {Fore.CYAN}。                                          {Fore.CYAN}。

''')


def cnc_demo_cloud():
    sys.stdout.write(f"\x1b]2;Cloud Destroyer [Proxy]: [{rb}] | Online.\x07")
    clear()
    print(f"""
\x1b[38;2;0;255;255m[ \x1b[38;2;233;233;233mCNC \x1b[38;2;0;255;255m] | \x1b[38;2;233;233;233mCloud Destroyer \x1b[38;2;0;255;255m | \x1b[38;2;0;255;255m[ \x1b[38;2;233;233;233mLayer4 \x1b[38;2;0;255;255m]

                       {Fore.CYAN}。                                    {Fore.CYAN}。                          {Fore.CYAN}。                                     {Fore.CYAN}。

                              {Fore.CYAN}。          {L}╔═╗{L}╦  ╔{L}═╗╦ ╦╔╦{L}╗　                        {Fore.CYAN}。
   {Fore.CYAN}。                                     {L}║  {L}║  ║{L} ║║ ║ ║{L}║　  {Fore.CYAN}。   
    　                                    {L}╚═╝{L}╩═╝╚{L}═╝╚═╝═╩{L}╝ {U}CL。
                              {U}════════╦═══════════════════════════╦════════                       {Fore.CYAN}。
      　                      {U}╦═══════╩═══════════════════════════╩═══════╗
                　            {U}║            　{Fore.CYAN}。                。         {U}║             　
               {Fore.CYAN}。             {U}║ =  =  =  ⚡ 𝓒𝓵𝓸𝓾𝓭 𝓓𝓮𝓼𝓽𝓻𝓸𝔂𝓮𝓻  ⚡  =   =  = ║    {Fore.CYAN}。
                              {U}║                  {Fore.CYAN}。　                     {U}║
 {Fore.CYAN}。         　                {U}╩═══════╦═══════════════════════════╦═══════╝                   {Fore.CYAN}。
                                      {U}╩═══════════════════════════╩═
                                              {U}Type: {Fore.CYAN}help
                         {Fore.CYAN}。                                          {Fore.CYAN}。
""")

def cnc_demo_options():

    cnc_demo_cloud()
        
    while(True):

        cnc = input(f'''{Fore.LIGHTMAGENTA_EX}╔{Fore.MAGENTA}══\x1b[38;2;233;233;233m[{Fore.CYAN}@Cloud\x1b[38;2;233;233;233m]
{Fore.LIGHTMAGENTA_EX}╚═{Fore.MAGENTA}═══{rojo}➤  {Fore.LIGHTGREEN_EX}''')
        elif cnc == "layer4" or cnc == "LAYER4" or cnc == "L4" or cnc == "l4":
            cnc_demo_layer4_Methods()
        elif cnc == "clear" or cnc == "CLEAR" or cnc == "CLS" or cnc == "cls":
            cnc_demo_cloud()
        elif cnc == "ports" or cnc == "port" or cnc == "PORTS" or cnc == "PORT":
            cnc_demo_ports_Global()

        elif "fvck" in cnc:
            try:
                ip = cnc.split()[1]
                port = cnc.split()[2]
                tiempo = cnc.split()[3]
                cnc_demo_rip_router()
                os.system(f'perl./fvck.pl {ip} {port} 65500 {tiempo}')
            except IndexError:
                print(f'{Fore.RED}fvck [ip] [port] [tiempo]')
                print(f'{gris}EJ: {gray}fvck 88.122.8.15 80 1200')


        elif "help" in cnc:
            clear()
            print(f'''
\x1b[38;2;0;255;255m[ \x1b[38;2;233;233;233mCNC \x1b[38;2;0;255;255m] | \x1b[38;2;233;233;233mCloud Destroyer \x1b[38;2;0;255;255m | \x1b[38;2;0;255;255m[ \x1b[38;2;233;233;233mLayer4 \x1b[38;2;0;255;255m]

                       {Fore.CYAN}。                                    {Fore.CYAN}。                          {Fore.CYAN}。                                     {Fore.CYAN}。

                              {Fore.CYAN}。          {L}╔═╗{L}╦  ╔{L}═╗╦ ╦╔╦{L}╗　                        {Fore.CYAN}。
   {Fore.CYAN}。                                     {L}║  {L}║  ║{L} ║║ ║ ║{L}║　  {Fore.CYAN}。   
    　                                    {L}╚═╝{L}╩═╝╚{L}═╝╚═╝═╩{L}╝ {U}CL。
                              {U}════════╦═══════════════════════════╦════════                       {Fore.CYAN}。
      　                      {U}╦═══════╩═══════════════════════════╩═══════╗
                　            {U}║            　{Fore.CYAN}。                。         {U}║             　
               {Fore.CYAN}。             {U}║ =  =  =  ⚡ 𝓒𝓵𝓸𝓾𝓭 𝓓𝓮𝓼𝓽𝓻𝓸𝔂𝓮𝓻  ⚡  =   =  = ║    {Fore.CYAN}。
                              {U}║                  {Fore.CYAN}。　                     {U}║
 {Fore.CYAN}。         　                {U}╩═══════╦═══════════════════════════╦═══════╝                   {Fore.CYAN}。
                                      {U}╩═══════════════════════════╩═
                         {Fore.CYAN}。                                          {Fore.CYAN}。
                                  {U}═════════╦════════════════╦══════════
                          {U}╔════════════════╩════════════════╩════════════════╗                          {Fore.CYAN}。
               {U}╔══════════╩══════════════════════════════════════════════════╩══════════╗
               {U}║          \x1b[38;2;0;212;14mport                                            \x1b[38;2;0;212;14mlayer4        {U}║
               {U}╚════════════════════════════════════════════════════════════════════════╝
{Fore.CYAN}。
                                                                                                                {Fore.CYAN}。                                   
                                {Fore.CYAN}。                                             {Fore.CYAN}。

                                                                                                                         
            ''')
        else:
            try:
                import time
                clear()
                cnc_command = cnc.split()[0]
                print(f'''
\x1b[38;2;0;255;255m[ \x1b[38;2;233;233;233mCNC \x1b[38;2;0;255;255m] | \x1b[38;2;233;233;233mCloud Destroyer \x1b[38;2;0;255;255m | \x1b[38;2;0;255;255m[ \x1b[38;2;233;233;233mComando No Encontrado \x1b[38;2;0;255;255m]
                                           
                         {gris} _______
                         {gris}| ___  o|
                         {gris}|[_-_]_ |
     {gris} ______________     {gris}|[_____]|
     |.------------.|    {gris}|[_____]|
     ||            ||    {gris}|[====o]|
     || {gris}Error: {rojo}404 {gris}||    {gris}|[_.--_]|
     {gris}||            ||    {gris}|[_____]|
     ||            ||    {gris}|      :|
     ||____________||    {gris}|      :|
 .==.|""  ......    |.==.{gris}|      :|
 |::| '-.________.-' |::|{gris}|      :|
 |''|  (__________)-.|''|{gris}|______:|
 `""`_.............._ ""`______
    /:::::::::::'':::\`;'-.-.  `|
   /::=========.:.-::"\ \ \--\   |
   \`""""""""""""""""/  \ \__)   |
    """"""""""""""""`    '========'

''')
                print(f"{color}> {reset}{color}[{Fore.GREEN}Cloud{Fore.LIGHTMAGENTA_EX}@{Fore.GREEN}System{color}]{color}:  {Back.RED}{Fore.YELLOW}NO SE A ENCONTRADO ESTE COMANDO {cnc_command}{reset}")
                time.sleep(2)
                cnc_demo_options()
            except IndexError:
                pass


def cnc_demo_login_cloud():
    clear()
    cnc_user = "Cloud"
    cnc_pass = "^&$#vBiK7#hHLNtIfB0i^y2w##H!7zI1Myp@y73afpohGfoR"
    print(f'''
\x1b[38;2;0;255;255m[ \x1b[38;2;233;233;233mCNC \x1b[38;2;0;255;255m] | \x1b[38;2;233;233;233m{timed} \x1b[38;2;0;255;255m| \x1b[38;2;0;255;255m[ \x1b[38;2;233;233;233mLogin \x1b[38;2;0;255;255m]    
    
{Fore.LIGHTCYAN_EX}   ________                __   ____                   __
{Fore.LIGHTCYAN_EX}  / ____/ /___  __  ______/ /  / __ \____ _____  ___  / /
{Fore.LIGHTCYAN_EX} / /   / / __ \/ / / / __  /  / /_/ / __ `/ __ \/ _ \/ / 
{Fore.LIGHTCYAN_EX}/ /___/ / /_/ / /_/ / /_/ /  / ____/ /_/ / / / /  __/ /  
{Fore.LIGHTCYAN_EX}\____/_/\____/\__,_/\__,_/  /_/    \__,_/_/ /_/\___/_/   
                                                         

    
    ''')
    cnc_useri = input(f'\n{color}[{rojo}Cloud{Fore.LIGHTMAGENTA_EX}@{rojo}System{color}] {Fore.LIGHTMAGENTA_EX} Usuario{Fore.GREEN}:{Fore.LIGHTYELLOW_EX} ')
    cnc_passi = getpass.getpass(prompt=f'\n{color}[{rojo}Cloud{Fore.LIGHTMAGENTA_EX}@{rojo}System{color}] {Fore.LIGHTMAGENTA_EX} Contraseña{Fore.GREEN}:{Fore.LIGHTYELLOW_EX} ')
    if cnc_useri != cnc_user or cnc_passi != cnc_pass:
        clear()
        print(f'''
\x1b[38;2;0;255;255m[ \x1b[38;2;233;233;233mCNC \x1b[38;2;0;255;255m] | \x1b[38;2;233;233;233m{timed} \x1b[38;2;0;255;255m| \x1b[38;2;0;255;255m[ \x1b[38;2;233;233;233mLogin \x1b[38;2;0;255;255m]    
    
{Fore.LIGHTCYAN_EX}   ________                __   ____                   __
{Fore.LIGHTCYAN_EX}  / ____/ /___  __  ______/ /  / __ \____ _____  ___  / /
{Fore.LIGHTCYAN_EX} / /   / / __ \/ / / / __  /  / /_/ / __ `/ __ \/ _ \/ / 
{Fore.LIGHTCYAN_EX}/ /___/ / /_/ / /_/ / /_/ /  / ____/ /_/ / / / /  __/ /  
{Fore.LIGHTCYAN_EX}\____/_/\____/\__,_/\__,_/  /_/    \__,_/_/ /_/\___/_/   
                                                         

    
    ''')
        Load2 = ["[■□□□□□□□□□]","[■■□□□□□□□□]", "[■■■□□□□□□□]", "[■■■■□□□□□□]", "[■■■■■□□□□□]", "[■■■■■■□□□□]", "[■■■■■■■□□□]", "[■■■■■■■■□□]", "[■■■■■■■■■□]", "[■■■■■■■■■■]"]

        for i in range(10):
            time.sleep(0.5)
            sys.stdout.write(f"\r{color}[{rojo}Cloud{Fore.LIGHTMAGENTA_EX}@{rojo}System{color}] {morado} Revisando Credenciales: {Fore.GREEN} "+ Load2[i % len(Load2)])
            sys.stdout.flush()
        print(f'\n{color}[{rojo}Cloud{Fore.LIGHTMAGENTA_EX}@{rojo}System{color}] {morado}: {Fore.RED}  Credenciales Incorrectas')
        time.sleep(1)
        cnc_demo_login_cloud()
    elif cnc_useri == cnc_user and cnc_passi == cnc_pass:
        clear()
        print(f'''
\x1b[38;2;0;255;255m[ \x1b[38;2;233;233;233mCNC \x1b[38;2;0;255;255m] | \x1b[38;2;233;233;233m{timed} \x1b[38;2;0;255;255m| \x1b[38;2;0;255;255m[ \x1b[38;2;233;233;233mLogin \x1b[38;2;0;255;255m]    
    
{Fore.LIGHTCYAN_EX}   ________                __   ____                   __
{Fore.LIGHTCYAN_EX}  / ____/ /___  __  ______/ /  / __ \____ _____  ___  / /
{Fore.LIGHTCYAN_EX} / /   / / __ \/ / / / __  /  / /_/ / __ `/ __ \/ _ \/ / 
{Fore.LIGHTCYAN_EX}/ /___/ / /_/ / /_/ / /_/ /  / ____/ /_/ / / / /  __/ /  
{Fore.LIGHTCYAN_EX}\____/_/\____/\__,_/\__,_/  /_/    \__,_/_/ /_/\___/_/   
                                                         

    
    ''')
        Load = ["[■□□□□□□□□□]","[■■□□□□□□□□]", "[■■■□□□□□□□]", "[■■■■□□□□□□]", "[■■■■■□□□□□]", "[■■■■■■□□□□]", "[■■■■■■■□□□]", "[■■■■■■■■□□]", "[■■■■■■■■■□]", "[■■■■■■■■■■]"]

        for i in range(10):
            time.sleep(0.5)
            sys.stdout.write(f"\r{color}[{rojo}Cloud{Fore.LIGHTMAGENTA_EX}@{rojo}System{color}] {morado} Revisando Credenciales: {Fore.GREEN} "+ Load[i % len(Load)])
            sys.stdout.flush()
        print(f'\n{color}[{rojo}Cloud{Fore.LIGHTMAGENTA_EX}@{rojo}System{color}] {morado}: {Fore.GREEN}  Credenciales Correctas')
        time.sleep(1)
        cnc_demo_options()

cnc_demo_login_cloud()
